Revit 2027 API
AnalysisDisplayColorSettings.MaxColor Property
 Color assigned to the maximum value.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color MaxColor { get; set; }
Public Property MaxColor As Color
	Get
	Set
public:
property Color^ MaxColor {
	Color^ get ();
	void set (Color^ value);
}
member MaxColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace